%%-------------------------------------------------------
%% @File     : goods_def.hrl
%% @Brief    : 物品相关参数定义
%% @Author   : DJR
%% @Date     : 2017-11-7
%%-------------------------------------------------------

%% 避免头文件多重包含
-ifndef(__GOODS_DEF_H__).
-define(__GOODS_DEF_H__, 0).

%% ====================================================================
%% 进程字典相关
%% ====================================================================
-define(ROLE_GOODS_STATE(RoleId), {role_goods_state, RoleId}).     %% 物品信息

%% ====================================================================
%% 物品位置相关
%% ====================================================================
%% -----------------------------------------------------
%% 位置定义
%% -----------------------------------------------------
-define(GOODS_LOC_BAG,              1).     %% 背包位置
-define(GOODS_LOC_STORAGE,          2).     %% 仓库位置
-define(GOODS_LOC_EQUIP,            3).     %% 装备位置

%% -----------------------------------------------------
%% 重要常数
%% -----------------------------------------------------
-define(GOODS_LOC_CACHE,            [1,2,3]).    %% 需缓存的位置

%% -----------------------------------------------------
%% 物品大类型定义
%% -----------------------------------------------------
-define(GOODS_TYPE_EQUIP,               11).    %% 类型 - 装备类
-define(GOODS_TYPE_GEM,                 12).    %% 类型 - 宝石类
-define(GOODS_TYPE_BUFF,                13).    %% 类型 - BUFF状态类
-define(GOODS_TYPE_CONSUME,             14).	  %% 类型 - 消耗类
-define(GOODS_TYPE_HP_BAG,              15).    %% 类型 - 生命药水
-define(GOODS_TYPE_GIFT,                16).    %% 类型 - 礼包类
-define(GOODS_TYPE_ITEM,                17).    %% 类型 - 道具类
-define(GOODS_TYPE_MATERIAL,            20).    %% 类型 - 材料

%% -----------------------------------------------------
%% 消耗类的子类型
%% -----------------------------------------------------
-define(GOODS_SUBTYPE_GOLD, 			      11).	    %% 子类型 - 元宝
-define(GOODS_SUBTYPE_BGOLD, 			      12).	    %% 子类型 - 绑元
-define(GOODS_SUBTYPE_COIN,         	  13).      %% 子类型 - 铜币
-define(GOODS_SUBTYPE_BCOIN,        	  14).      %% 子类型 - 绑定铜币
-define(GOODS_SUBTYPE_EXP,          	  15).	    %% 子类型 - 经验卡
-define(GOODS_SUBTYPE_ONLY_BGOLD,   	  16).      %% 子类型 - 仅限绑定元宝
-define(GOODS_SUBTYPE_ONLY_BCOIN,   	  17).      %% 子类型 - 仅限绑定铜币

%% ====================================================================
%% 物品其他定义
%% ====================================================================

%% 药水不可回复的场景类型
-define(REPLY_SCENE_LIMIT,          []).

-endif.  %% __GOODS_DEF_H__