%%%-------------------------------------------------------------------
%%% @author sy
%%% @copyright (C) 2019, <COMPANY>
%%% @doc
%%% 游戏公共节点启动模版
%%% @end
%%% Created : 29. 9月 2019 19:50
%%%-------------------------------------------------------------------

-module(tpl_node_public).
-include("common.hrl").

-export([
    start/0,
    stop/0
]).

%% =====================================================================
%% API
%% =====================================================================

%% @doc 启动游戏服公共节点
start() ->
    ?ERROR_MSG("server startup, node ~w ...", [node()]),
    ok.

%% @doc 关闭游戏服公共节点
stop() ->
    ?ERROR_MSG("server shutdown, node ~w ...", [node()]),
    timer:sleep(10000),
    ok.